Update lecture_04_scalable_ml_teach.md
